Revit 2027 API
FabricArea.CopyCurveLoopsInSketch Method
 Creates copies of the CurveLoops in the FabricArea sketch.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> CopyCurveLoopsInSketch()
Public Function CopyCurveLoopsInSketch As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ CopyCurveLoopsInSketch()
member CopyCurveLoopsInSketch : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The copy of the curve loops.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace